TaLucGiaHoang/SW-TM4C/TivaWare_C_Series-2.1.4.178/sensorlib/hw_kxti9.h
//*****************************************************************************
//
// The following are defines for the bit fields in the KXTI9_O_TDT_H_THRESH
// register.
//
//*****************************************************************************
#define KXTI9_TDT_H_THRESH_M    0xFF        // Threshold high value
#define KXTI9_TDT_H_THRESH_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the KXTI9_O_TDT_L_THRESH
// register.
//
//*****************************************************************************
#define KXTI9_TDT_L_THRESH_M    0xFF        // Threshold low value
#define KXTI9_TDT_L_THRESH_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the KXTI9_O_TDT_TAP_TIMER
// register.
//
//*****************************************************************************
#define KXTI9_TDT_TAP_TIMER_M   0xFF        // Tap event counter
#define KXTI9_TDT_TAP_TIMER_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the KXTI9_O_TDT_TOTAL_TIMER
// register.
//
//*****************************************************************************
#define KXTI9_TDT_TOTAL_TIMER_M 0xFF        // Double tap event counter
#define KXTI9_TDT_TOTAL_TIMER_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// KXTI9_O_TDT_LATENCY_TIMER register.
//
//*****************************************************************************
#define KXTI9_TDT_LATENCY_TIMER_M                                             \
                                0xFF        // Tap event latency counter
#define KXTI9_TDT_LATENCY_TIMER_S                                             \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the KXTI9_O_TDT_WINDOW_TIMER
// register.
//
//*****************************************************************************
#define KXTI9_TDT_WINDOW_TIMER_M                                              \
                                0xFF        // Tap event window counter
#define KXTI9_TDT_WINDOW_TIMER_S                                              \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the KXTI9_O_BUF_CTRL1
// register.
//
//*****************************************************************************
#define KXTI9_BUF_CTRL1_M       0x7F        // Buffer sample threshold
#define KXTI9_BUF_CTRL1_S       0

//*****************************************************************************
//
// The following are defines for the bit fields in the KXTI9_O_BUF_CTRL2
// register.
//
//*****************************************************************************
#define KXTI9_BUF_CTRL2_BUFE    0x80        // Buffer enable
#define KXTI9_BUF_CTRL2_BUF_RES 0x40        // Buffer resolution
#define KXTI9_BUF_CTRL2_BUF_M_M 0x03        // Buffer mode
#define KXTI9_BUF_CTRL2_BUF_M_FIFO                                            \
                                0x00        // FIFO mode
#define KXTI9_BUF_CTRL2_BUF_M_STREAM                                          \
                                0x01        // Stream mode
#define KXTI9_BUF_CTRL2_BUF_M_TRIG                                            \
                                0x02        // Trigger mode
#define KXTI9_BUF_CTRL2_BUF_M_FILO                                            \
                                0x03        // FILO mode
#define KXTI9_BUF_CTRL2_BUF_M_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the KXTI9_O_STATUS1
// register.
//
//*****************************************************************************
#define KXTI9_STATUS1_SMP_LEV_M 0xFF        // Number of bytes in sample buffer
#define KXTI9_STATUS1_SMP_LEV_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the KXTI9_O_STATUS2
// register.
//
//*****************************************************************************
#define KXTI9_STATUS2_BUF_TRIG  0x80        // Trigger mode status

//*****************************************************************************
//
// The following are defines for the bit fields in the KXTI9_O_BUF_CLEAR
// register.
//
//*****************************************************************************
#define KXTI9_BUF_CLEAR_M       0xFF        // Data is unpredictable
#define KXTI9_BUF_CLEAR_S       0

//*****************************************************************************
//
// The following are defines for the bit fields in the KXTI9_O_SELF_TEST
// register.
//
//*****************************************************************************
#define KXTI9_SELF_TEST_M       0xFF        // Writing 0xCA enables MEMS
                                            // self-test
#define KXTI9_SELF_TEST_S       0

//*****************************************************************************
//
// The following are defines for the bit fields in the KXTI9_O_WUF_THRESH
// register.
//
//*****************************************************************************
#define KXTI9_WUF_THRESH_M      0xFF        // Acceleration wake-up threshold
#define KXTI9_WUF_THRESH_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the KXTI9_O_TILT_ANGLE
// register.
//
//*****************************************************************************
#define KXTI9_TILT_ANGLE_M      0xFF        // Tilt angle threshold
#define KXTI9_TILT_ANGLE_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the KXTI9_O_HYST_SET
// register.
//
//*****************************************************************************
#define KXTI9_HYST_SET_RES_M    0xE0        // Factory set value - do not
                                            // change
#define KXTI9_HYST_SET_HYST_M   0x1F        // Hysteresis angle
#define KXTI9_HYST_SET_RES_S    5
#define KXTI9_HYST_SET_HYST_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the KXTI9_O_BUF_READ
// register.
//
//*****************************************************************************
#define KXTI9_BUF_READ_M        0xFF        // Read data from buffer
#define KXTI9_BUF_READ_S        0

#endif // __SENSORLIB_HW_KXTI9_H__
